app/Controllers/Auth.php

SELECT *
FROM `tbl_user`
WHERE `email` = '3nindi@gmail.com'
---
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $check = $this->userModel->where('email', $email)->find();