app/Controllers/BaseController.php

    public function setSession($user_id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($user_id);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`user_id` = '1'