app/Controllers/Home.php

SELECT *
FROM `tbl_web_config`
WHERE `tbl_web_config`.`config_id` = 1
---
    public function kuesioner()
    {
        $config = $this->webConfigModel->find(1);