app/Controllers/Jawaban.php

    public function index()
    {
        $config = $this->WebConfigModel->find(1);
---
SELECT *
FROM `tbl_web_config`
WHERE `tbl_web_config`.`config_id` = 1

    public function reloadDatatables()
    {
        if($this->request->isAJAX())
        {

            $length		    = @$_POST['length'];
            $start		    = @$_POST['start'];
            $searchValue 	= @$_POST['search']['value'];
            $orderColumn 	= @$_POST['order']['0']['column'];
            $orderDir 	    = @$_POST['order']['0']['dir'];
            $order 		    = @$_POST['order'];

            $params = [
                'length' 		            => $length,
                'start' 		            => $start,
                'searchValue' 		        => $searchValue,
                'orderColumn' 	            => $orderColumn,
                'orderDir'                  => $orderDir,
                'order'                     => $order,
            ];

            // return json_encode($params);

            $data = $this->jawabanModel->getDatatables($params);

            $no = $start + 1;

            $allQuestion = $this->pertanyaanModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_pertanyaan`

    public function lock()
    {
        if($this->request->isAJAX())
        {
            $config = $this->WebConfigModel->find(1);

            if($config['lock'] == '0')
            {
                $data = [
                    'lock' => 1
                ];
            }else{
                $data = [
                    'lock' => '0'
                ];
            }
            $this->WebConfigModel->update(1, $data);
---
SELECT *
FROM `tbl_web_config`
WHERE `tbl_web_config`.`config_id` = 1
UPDATE `tbl_web_config` SET `lock` = '0'
WHERE `tbl_web_config`.`config_id` IN (1)