app/Models/JawabanModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_jawaban`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();