app/Models/PertanyaanModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_pertanyaan`
---
    public function countFiltered($params)
    {
        $this->getDatatablesQuery($params);
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_pertanyaan`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();